import React, { useState } from 'react'

interface Props {
    curSubstance: string
}

const EachSubStanceQuestionsPage = ({ curSubstance }: Props) => {
    const [curSubStanceQuestion, setCurSubStanceQuestion] = useState<number>(1);
    const substanceQuestions = [
        {
            id: 1,
            question: `{ใน 3 เดือนที่ผ่านมา คุณใช้${curSubstance}บ่อยแค่ไหน ?}`,
            options: ["ไม่เคย", "1 - 2 ครั้ง", "ทุกเดือน", "ทุกสัปดาห์", "เกือบทุกวัน"]
        },
        {
            id: 2,
            question: `{ใน 3 เดือนที่ผ่านมา คุณรู้สึกอยากใช้ ${curSubstance}จนทนไม่ได้บ่อยแค่ไหน ?}`,
            options: ["ไม่เคย", "1 - 2 ครั้ง", "ทุกเดือน", "ทุกสัปดาห์", "เกือบทุกวัน"]
        },
        {
            id: 3,
            question: `{ใน 3 เดือนที่ผ่านมา การใช้${curSubstance} ทําให้คุณมีปัญหาสุขภาพ ครอบครัว สังคม กฎหมายหรือการเงินหรือไม่ ? บ่อยแค่ไหน ?}`,
            options: ["ไม่เคย", "1 - 2 ครั้ง", "ทุกเดือน", "ทุกสัปดาห์", "เกือบทุกวัน"]
        },
        {
            id: 4,
            question: `{ใน 3 เดือนที่ผ่านมา การใช้${curSubstance} ทําให้คุณไม่สามารถทํากิจกรรม ที่คุณทําได้เป็นปกติ บ่อยแค่ไหน ?}`,
            options: ["ไม่เคย", "1 - 2 ครั้ง", "ทุกเดือน", "ทุกสัปดาห์", "เกือบทุกวัน"]
        },
        {
            id: 5,
            question: `{เพื่อนฝูง ญาติ หรือคนอื่น เคย แสดงความเป็นห่วงเกี่ยวกับ การใช้สาร (สารตัวที่หนึ่ง สารตัวที่สอง ฯลฯ) ของคุณหรือไม่ ?}`,
            options: ["ไม่เคย", "1 - 2 ครั้ง", "ทุกเดือน", "ทุกสัปดาห์", "เกือบทุกวัน"]
        },
        {
            id: 6,
            question: `{คุณเคยพยายามลด หรือหยุดใช้สาร (สารตัวที่หนึ่ง สารตัวที่สอง ฯลฯ) แต่ไม่ประสบความสําเร็จ หรือไม่ ?}`,
            options: ["ไม่เคย", "1 - 2 ครั้ง", "ทุกเดือน", "ทุกสัปดาห์", "เกือบทุกวัน"]
        },
        {
            id: 7,
            question: `{คุณเคยใช้${curSubstance}โดยการฉีดหรือไม่ ?(นอกเหนือจากการใช้ทางการแพทย์)}`,
            options: ["ไม่เคย", "1 - 2 ครั้ง", "ทุกเดือน", "ทุกสัปดาห์", "เกือบทุกวัน"]
        },
        {
            id: 8,
            question: `{ใน 3 เดือนที่ผ่านมา คุณใช้${curSubstance}บ่อยแค่ไหน ?}`,
            options: ["ไม่เคย", "1 - 2 ครั้ง", "ทุกเดือน", "ทุกสัปดาห์", "เกือบทุกวัน"]
        },
    ]
    return (
        <div>EachSubStanceQuestionsPage</div>
    )
}

export default EachSubStanceQuestionsPage