export const substantsData = [
    {
        id:1,
        name: "ยาสูบ",
        description: "บุหรี่ เส้นแบบเคี้ยว ซิการ์ บุหรี่ไฟฟ้า ไปป์ ฯลฯ",
    }, {
        id:2,
        name: "เครื่องดื่ม แอลกอฮอล์",
        description: "เบียร์ ไวน์ เหล้า ยาดอง โซจู ฯลฯ",
    }, {
        id:3,
        name: "กัญชา",
        description: "กัญชาแห้ง ยางกัญชา น้ำกัญชา ฯลฯ",
    }, {
        id:4,
        name: "โคเคน",
        description: "โค้ก แคร็ก ฯลฯ",
    }, {
        id:5,
        name: "ยากระตุ้นประสาทกลุ่มแอมเฟตามีน",
        description: "ยาบ้า ยาอี ยาไอซ์ สปีด ยาลดความอ้วน ฯลฯ",
    }, {
        id:6,
        name: "สารระเหย",
        description: "ไนตรัส กาว น้ำมันรถ ทินเนอร์ ฯลฯ",
    }, {
        id:7,
        name: "ยากล่อมประสาท ยานอนหลับ",
        description: "วาเลี่ยม โรฮิปนอล ดอมิกุม มาโน โซแลม B5 ฯลฯ",
    }, {
        id:8,
        name: "ยาหลอนประสาท",
        description: "ยาเค เห็ดเมา แอลเอสดี แอซิด พีซีพี ฯลฯ",
    }, {
        id:9,
        name: "สารกลุ่มฝิ่น",
        description: "เฮโรอิน มอร์ฟีน ทรามาดอล เมทาโดน บูพรีนอฟิน โคเดอิน ",
    }, {
        id:10,
        name: "ใบกระท่อม",
        description: "",
    }, {
        id:11,
        name: "แก๊สหัวเราะ (ฮีเลียม)",
        description: "",
    },
]